sedimenting-block/fluid-openfoam/system/preciceDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      preciceDict;
}

preciceConfig "../precice-config.xml";

participant Fluid;

modules (FF);

FF
{
  nameAlpha alphaSolid;
  nameExplicitMomentum ExplicitMomentum;
  nameImplicitMomentum ImplicitMomentum;
};


interfaces
{
  Interface1
  {
    mesh              Fluid-Mesh;
    patches           ();
    locations         volumeCenters;
    
    readData
    (
        ImplicitMomentum
        ExplicitMomentum
        Alpha
    );

    writeData
    (
        Velocity
        PressureGradientFull
    );
  };
};
